
//User 넣기
insert into accounts(name, email)
values ('현진','kkk@gmail.com')

insert into accounts(name, email)
values ('연아','aaa@gmail.com')

insert into accounts(name, email)
values ('진아','bbb@gmail.com')

insert into accounts(name, email)
values ('서현','ccc@gmail.com')

insert into accounts(name, email)
values ('예은','ddd@gmail.com')


//basenews 넣기
insert into basenews(category_id,sub_category_id,title,description,is_daily_news,likes_count,view_count)
values(1,2,'尹 “탄핵은 예외적 조항…국회가는 것은 의무 아냐”[윤대통령 대국민 담화]', '윤석열 대통령은 7일 탄핵 소추에 대해 “아주 중범죄에 해당하는 사람들한테 하는 예외적인 조항”이라며 “미국 대통령 중 여소야대는 수도 없이 많았지만 탄핵당한 대통령이 하나도 없다”고 밝혔다.윤 대통령은 이날 오전 용산 대통령실 청사에서 열린 기자회견에서 국회와의 관계에 대한 질문에 답변하면서 “이미 수도 없이 조사한 특검법을 반복해서, 자기들이 소문만 낸 것을 붙여서, 동행 명령권을 남발하고”라며 “저는 국회에 오지 말라는 얘기라고 생각해서 안 간 것”이라고 말했다.윤 대통령은 “저는 국회를 굉장히 가고 싶어 하는 사람이고, 내년에는 꼭 가고 싶다”며 취임 첫해에 시정연설을 언급하고 “악수도 거부하고 야유도 하고 대통령 그만두지 여기 왜 왔냐는 이런 사람부터, 이거는 좀 아닌 것 같다”고 밝혔다.이어 “대통령이 국회에 가는 것은 의무는 아니고 발언권이 있는 것”이라며 “아무리 정치권에서 싸우더라도 그날 하루만은 기본 프로토콜로 하는 모습을 국민에게 보여주자는 것인데, 난장판이 되는 모습에 대통령이 가는 것을 국민한테 보여주는 것이 국회에 도움이 되는지 모르겠다”며 이렇게 말했다.그러면서 “이번에도 사실은 (시정연설에) 제가 가려고 다 준비했다가 총리께서 말씀하셨는데 ‘야, 윤석열이 오라 그래’ 이런 얘기들이 나왔다고 하는 것을 저도 들었다”며 “국회에 오라는 것은 ‘내가 대통령 너 망신 좀 줘야 되겠으니까 국민들 보는 앞에서 무릎 꿇고 망신 좀 당해라’, 이것은 정치를 살리자는 얘기가 아니라 정치를 죽이자는 얘기가 아닌가 싶다”고 말했다.윤 대통령은 한동훈 국민의힘 대표와의 갈등 문제에 대해 “언론에서도 자꾸 갈등을 부추기는 것 아닌가 생각한다”라며 “중요한 것은 초심으로 가야 한다는 것”이라고 밝혔다.윤 대통령은 “단순한 당정 문제를 떠나 회사 내에서 문제, 교우 관계에서 문제가 생길 때는 초심으로 가야 한다”며 “정부는 정부대로, 당은 당대로 국민을 위해 가장 잘 일할 수 있는 가장 유능한 정부, 발 빠른 당이 되기 위해 일을 열심히 같이하다 보면 관계가 좋아질 거라고 생각한다”고 말했다.이어 “국민의 이익을 위해 정부와 대통령실과 당이 계속 머리를 맞대고 일을 하면 자주 만나야 하지 않겠나”라며 “선공후사이기 때문에 그런 문제는 풀어가는 것”이라고 했다.그러면서 “개인적인 감정을 가지고 정치를 하는 것이 아니라 일을 같이하면서 공동의 과업을 찾아 나가고, 공동의 정치적 이익을 추구해 나갈 강력한 접착제가 되는 것”이라며 “순방 다녀오고 당과의 편한 소통 자리를 많이 만들겠다”고 덧붙였다.지지율이 10%대를 기록하는 것과 관련해 윤 대통령은 “참모들을 통해 제가 바가지 긁기를 많이 당하고 있다”며 “어떤 언론 기사를 저한테 딱 주면서 ‘이제는 전광판을 좀 보고 뛰세요’라는 칼럼이었다”고 밝혔다.윤 대통령은 “대구·경북 지역에 절대적인 지지가 저를 이렇게(대통령으로) 만든 것이라는 생각을 한다”며 “얼마나 아꼈으면, 얼마나 실망이 크시겠나 생각을 하고 있다”고 말했다.이어 “어떤 개혁을 추진해 나가는 데 뚝심 있게 밀어붙여야 하는 부분과 국민들의 불편함과 속상함을 살펴 가면서 해야 하는 부분에서, 너무 앞부분만 드러나면 속도 상하고, 주변의 일로 논란화되고 하니 그러시지 않나 생각이 된다”고 분석했다.그러면서 “국가의 미래를 위해서 강하게 싸우면서도 가야 될 부분과, 국민들의 마음을 최소화하고 살펴 가면서 해야 하는 부분들을 잘 가려서 해보겠다”며 “그러면 좀 나아지지 않겠나”라고 했다.',false,ARRAY[0,0,0],0)


insert into basenews(category_id,sub_category_id,title,description,is_daily_news,likes_count,view_count)
values(1,2,'尹 “탄핵은 예외적 조항…국회가는 것은 의무 아냐”[윤대통령 대국민 담화]', '윤석열 대통령은 7일 탄핵 소추에 대해 “아주 중범죄에 해당하는 사람들한테 하는 예외적인 조항”이라며 “미국 대통령 중 여소야대는 수도 없이 많았지만 탄핵당한 대통령이 하나도 없다”고 밝혔다.윤 대통령은 이날 오전 용산 대통령실 청사에서 열린 기자회견에서 국회와의 관계에 대한 질문에 답변하면서 “이미 수도 없이 조사한 특검법을 반복해서, 자기들이 소문만 낸 것을 붙여서, 동행 명령권을 남발하고”라며 “저는 국회에 오지 말라는 얘기라고 생각해서 안 간 것”이라고 말했다.윤 대통령은 “저는 국회를 굉장히 가고 싶어 하는 사람이고, 내년에는 꼭 가고 싶다”며 취임 첫해에 시정연설을 언급하고 “악수도 거부하고 야유도 하고 대통령 그만두지 여기 왜 왔냐는 이런 사람부터, 이거는 좀 아닌 것 같다”고 밝혔다.이어 “대통령이 국회에 가는 것은 의무는 아니고 발언권이 있는 것”이라며 “아무리 정치권에서 싸우더라도 그날 하루만은 기본 프로토콜로 하는 모습을 국민에게 보여주자는 것인데, 난장판이 되는 모습에 대통령이 가는 것을 국민한테 보여주는 것이 국회에 도움이 되는지 모르겠다”며 이렇게 말했다.그러면서 “이번에도 사실은 (시정연설에) 제가 가려고 다 준비했다가 총리께서 말씀하셨는데 ‘야, 윤석열이 오라 그래’ 이런 얘기들이 나왔다고 하는 것을 저도 들었다”며 “국회에 오라는 것은 ‘내가 대통령 너 망신 좀 줘야 되겠으니까 국민들 보는 앞에서 무릎 꿇고 망신 좀 당해라’, 이것은 정치를 살리자는 얘기가 아니라 정치를 죽이자는 얘기가 아닌가 싶다”고 말했다.윤 대통령은 한동훈 국민의힘 대표와의 갈등 문제에 대해 “언론에서도 자꾸 갈등을 부추기는 것 아닌가 생각한다”라며 “중요한 것은 초심으로 가야 한다는 것”이라고 밝혔다.윤 대통령은 “단순한 당정 문제를 떠나 회사 내에서 문제, 교우 관계에서 문제가 생길 때는 초심으로 가야 한다”며 “정부는 정부대로, 당은 당대로 국민을 위해 가장 잘 일할 수 있는 가장 유능한 정부, 발 빠른 당이 되기 위해 일을 열심히 같이하다 보면 관계가 좋아질 거라고 생각한다”고 말했다.이어 “국민의 이익을 위해 정부와 대통령실과 당이 계속 머리를 맞대고 일을 하면 자주 만나야 하지 않겠나”라며 “선공후사이기 때문에 그런 문제는 풀어가는 것”이라고 했다.그러면서 “개인적인 감정을 가지고 정치를 하는 것이 아니라 일을 같이하면서 공동의 과업을 찾아 나가고, 공동의 정치적 이익을 추구해 나갈 강력한 접착제가 되는 것”이라며 “순방 다녀오고 당과의 편한 소통 자리를 많이 만들겠다”고 덧붙였다.지지율이 10%대를 기록하는 것과 관련해 윤 대통령은 “참모들을 통해 제가 바가지 긁기를 많이 당하고 있다”며 “어떤 언론 기사를 저한테 딱 주면서 ‘이제는 전광판을 좀 보고 뛰세요’라는 칼럼이었다”고 밝혔다.윤 대통령은 “대구·경북 지역에 절대적인 지지가 저를 이렇게(대통령으로) 만든 것이라는 생각을 한다”며 “얼마나 아꼈으면, 얼마나 실망이 크시겠나 생각을 하고 있다”고 말했다.이어 “어떤 개혁을 추진해 나가는 데 뚝심 있게 밀어붙여야 하는 부분과 국민들의 불편함과 속상함을 살펴 가면서 해야 하는 부분에서, 너무 앞부분만 드러나면 속도 상하고, 주변의 일로 논란화되고 하니 그러시지 않나 생각이 된다”고 분석했다.그러면서 “국가의 미래를 위해서 강하게 싸우면서도 가야 될 부분과, 국민들의 마음을 최소화하고 살펴 가면서 해야 하는 부분들을 잘 가려서 해보겠다”며 “그러면 좀 나아지지 않겠나”라고 했다.',true,ARRAY[0,0,0],0)

insert into basenews(upload_date,keyword_id,category_id,sub_category_id,title,description,is_daily_news,likes_count,view_count)
values('20241118',3,1,2,'尹 “탄핵은 예외적 조항…국회가는 것은 의무 아냐”[윤대통령 대국민 담화]', '윤석열 대통령은 7일 탄핵 소추에 대해 “아주 중범죄에 해당하는 사람들한테 하는 예외적인 조항”이라며 “미국 대통령 중 여소야대는 수도 없이 많았지만 탄핵당한 대통령이 하나도 없다”고 밝혔다.윤 대통령은 이날 오전 용산 대통령실 청사에서 열린 기자회견에서 국회와의 관계에 대한 질문에 답변하면서 “이미 수도 없이 조사한 특검법을 반복해서, 자기들이 소문만 낸 것을 붙여서, 동행 명령권을 남발하고”라며 “저는 국회에 오지 말라는 얘기라고 생각해서 안 간 것”이라고 말했다.윤 대통령은 “저는 국회를 굉장히 가고 싶어 하는 사람이고, 내년에는 꼭 가고 싶다”며 취임 첫해에 시정연설을 언급하고 “악수도 거부하고 야유도 하고 대통령 그만두지 여기 왜 왔냐는 이런 사람부터, 이거는 좀 아닌 것 같다”고 밝혔다.이어 “대통령이 국회에 가는 것은 의무는 아니고 발언권이 있는 것”이라며 “아무리 정치권에서 싸우더라도 그날 하루만은 기본 프로토콜로 하는 모습을 국민에게 보여주자는 것인데, 난장판이 되는 모습에 대통령이 가는 것을 국민한테 보여주는 것이 국회에 도움이 되는지 모르겠다”며 이렇게 말했다.그러면서 “이번에도 사실은 (시정연설에) 제가 가려고 다 준비했다가 총리께서 말씀하셨는데 ‘야, 윤석열이 오라 그래’ 이런 얘기들이 나왔다고 하는 것을 저도 들었다”며 “국회에 오라는 것은 ‘내가 대통령 너 망신 좀 줘야 되겠으니까 국민들 보는 앞에서 무릎 꿇고 망신 좀 당해라’, 이것은 정치를 살리자는 얘기가 아니라 정치를 죽이자는 얘기가 아닌가 싶다”고 말했다.윤 대통령은 한동훈 국민의힘 대표와의 갈등 문제에 대해 “언론에서도 자꾸 갈등을 부추기는 것 아닌가 생각한다”라며 “중요한 것은 초심으로 가야 한다는 것”이라고 밝혔다.윤 대통령은 “단순한 당정 문제를 떠나 회사 내에서 문제, 교우 관계에서 문제가 생길 때는 초심으로 가야 한다”며 “정부는 정부대로, 당은 당대로 국민을 위해 가장 잘 일할 수 있는 가장 유능한 정부, 발 빠른 당이 되기 위해 일을 열심히 같이하다 보면 관계가 좋아질 거라고 생각한다”고 말했다.이어 “국민의 이익을 위해 정부와 대통령실과 당이 계속 머리를 맞대고 일을 하면 자주 만나야 하지 않겠나”라며 “선공후사이기 때문에 그런 문제는 풀어가는 것”이라고 했다.그러면서 “개인적인 감정을 가지고 정치를 하는 것이 아니라 일을 같이하면서 공동의 과업을 찾아 나가고, 공동의 정치적 이익을 추구해 나갈 강력한 접착제가 되는 것”이라며 “순방 다녀오고 당과의 편한 소통 자리를 많이 만들겠다”고 덧붙였다.지지율이 10%대를 기록하는 것과 관련해 윤 대통령은 “참모들을 통해 제가 바가지 긁기를 많이 당하고 있다”며 “어떤 언론 기사를 저한테 딱 주면서 ‘이제는 전광판을 좀 보고 뛰세요’라는 칼럼이었다”고 밝혔다.윤 대통령은 “대구·경북 지역에 절대적인 지지가 저를 이렇게(대통령으로) 만든 것이라는 생각을 한다”며 “얼마나 아꼈으면, 얼마나 실망이 크시겠나 생각을 하고 있다”고 말했다.이어 “어떤 개혁을 추진해 나가는 데 뚝심 있게 밀어붙여야 하는 부분과 국민들의 불편함과 속상함을 살펴 가면서 해야 하는 부분에서, 너무 앞부분만 드러나면 속도 상하고, 주변의 일로 논란화되고 하니 그러시지 않나 생각이 된다”고 분석했다.그러면서 “국가의 미래를 위해서 강하게 싸우면서도 가야 될 부분과, 국민들의 마음을 최소화하고 살펴 가면서 해야 하는 부분들을 잘 가려서 해보겠다”며 “그러면 좀 나아지지 않겠나”라고 했다.',true,ARRAY[0,0,0],0)

//quiz 넣기
insert into quiz(basenews_id,problem,comment,answer)
values(6,'코끼리는 날 수 있다','해설해설',false)

insert into quiz(basenews_id,problem,comment,answer)
values(10,'고양이는 날 수 있다','해설해설',false)

insert into quiz(basenews_id,problem,comment,answer)
values(7,'강아지는 날 수 없다','해설해설',true)

insert into quiz(basenews_id,problem,comment,answer)
values(8,'지구는 둥글다','해설해설',true)

insert into quiz(basenews_id,problem,comment,answer)
values(9,'잠이 온다','해설해설',true)


